{
  "bosses": [
    {
      "id": 1,
      "name": "Bell Beast",
      "location": "The Marrow",
      "health": 150,
      "phases": 2,
      "image": "../images/Bosses/bellbeast.png",
      "information": {
        "in-game events": "The Bell Beast is initially found in The Marrow, where she is trapped in Silk. Once the Bell Beast is freed using the Silkspear skill, she attacks Hornet. After her defeat, the Bell Beast allows Hornet to ride her and acts as the game's fast travel system. The Bell Beast also drops the first Silk Heart which takes Hornet into a Silk dream when she collects it. Upon waking, Hornet is now on the station platform next to the ready and waiting Bell Beast. In Act 3 upon reaching any Bellway, the Bell Beast is missing from their station and a hole is open where they would normally reside. Hornet can enter this hole and drop into the Bellways where she then fights the Bell Eater. Upon defeating the Bell Eater, the Bell Beast returns to deliver the final blow before Hornet returns back to the station. It is then revealed that the Bell Beast is now a mother and has a litter of Beastlings. From them Hornet learns the Beastling Call which can be played on her Needolin on any stable surface to summon Beastlings to take her directly to whichever Bellway station the Bell Beast is presently at.",
        "behavior and tactics": {
          "summary": "The Bell Beast remains burrowed for the most of the fight, but pops up out of the ground to perform her various attacks. The location the Bell Beast emerges from is indicated by rumbling dust clouds.",
          "phases": [
            {
              "name": "Phase 1",
              "description": "In the first phase, she has the following attacks:",
              "attacks": [
                {
                  "name": "Charge",
                  "description": "The Bell Beast charges forward from one end of the arena to the other. The initial dust cloud will barely graze the foreground hanging bell's bottom."
                },
                {
                  "name": "Leap",
                  "description": "The Bell Beast hops in the air across the entire arena and slams into the ground. She pauses for a moment after landing before burrowing again. The initial dust cloud will completely envelop both foreground bells, being notably taller."
                },
                {
                  "name": "Bell Burst",
                  "description": "The Bell Beast bursts her upper body out of the ground, sending out 2 rolling bells, one in each direction, before going down underground again. She gains this attack when her HP reaches 120. The initial dust cloud is visibly thinner."
                }
              ],
              "notes": "Contact with Bell Beast deals 2 Masks of damage."
            },
            {
              "name": "Phase 2",
              "trigger": "After reaching 75 HP, the Bell Beast will pop up her upper body to roar before burrowing again; the ground rumbles as 8 bells drop from random locations in the ceiling. These bells bounce once before disappearing.",
              "description": "After this, phase 2 begins and she modifies 2 preexisting attacks:",
              "attacks": [
                {
                  "name": "Bell Burst (Modified)",
                  "description": "A third bell drops near where the Bell Beast burrowed shortly after she launches the first 2 bells."
                },
                {
                  "name": "Bell Drop",
                  "description": "A bell now drops from the ceiling in a random location after the Bell Beast lands from using the Leap attack."
                }
              ]
            }
          ],
          "strategy": "While it is slow enough to manage its attacks simply by avoiding the dust clouds then responding accordingly, there are some subtleties to the dust clouds that can be used to position oneself to hit Bell Beast even more, should one wish to finish the fight more quickly."
        }
      }
    },
    {
      "id": 2,
      "name": "Bell Eater",
      "location": "Any Bellway (Act 3)",
      "health": 800,
      "phases": 2,
      "image": "../images/Bosses/belleater.png",
      "information": {
        "in-game events": "Upon starting Act 3, visiting and calling out in any Bellway will cause the Bell Eater to burst out and roar instead of the Bell Beast. Afterwards, Hornet can follow the Bell Eater down a hole into the tunnels where it will be fought as a boss. It is finished off by Bell Beast, who returns in to deliver the final blow. The Bell Beast is now accompanied by its Beastlings who teach Hornet the Beastling Call.",
        "behavior and tactics": {
          "summary": "When Hornet approaches, Bell Eater first uses its body to wall off her left and right sides, creating a small arena. In this fight, the Bell Eater's grey plated body is immune to damage, and it must be attacked by hitting its soft beige rear, or its red head section which appear separately during attacks but share a health pool.",
          "phases": [
            {
              "name": "Phase 1",
              "description": "The Bell Eater stays burrowed for most of the battle:",
              "attacks": [
                {
                  "name": "Lash Out",
                  "description": "If Hornet gets too close to or strikes one of Bell Eater's legs at the edges of the arena, it slices wildly at her. Each leg can attack separately."
                },
                {
                  "name": "Spit",
                  "description": "Bell Eater pokes its head out, either up from the ground or down from the ceiling. It then spits out a spray of arcing red projectiles that fall to the ground. These projectiles can be destroyed. The Bell Eater will loosely track Hornet when firing projectiles."
                },
                {
                  "name": "Flail",
                  "description": "If Bell Eater pokes its head out, it can wind up before swinging its 4 front legs wildly. It performs this attack more often if Hornet is close to its head."
                },
                {
                  "name": "Bombardment",
                  "description": "Bell Eater pokes its rear end out, either up from the ground or down from the ceiling, and fires 2 bouncing red explosives; alternating sides for each. The rear is angled slightly to indicate which direction it will shoot from, and its bombs explode after bouncing around 3 times or upon hitting a target or wall. They can also be deflected by a Needle strike."
                }
              ]
            },
            {
              "name": "Phase 2",
              "trigger": "After Bell Eater reaches 360 HP, the walls move outward to expand the arena to about twice the width.",
              "description": "In this phase, Bell Eater's head and rear can now appear simultaneously to each perform an attack. It also modifies 2 previous attacks:",
              "attacks": [
                {
                  "name": "Bell Bulldoze",
                  "description": "Bell Eater rushes forwards across the entire arena, either against the ground or sticking to the ceiling, before switching surfaces and rushing in the opposite direction along the opposing face. 2 bells will fall and bounce once in random locations when it burrows against the ground, and 3 will fall when it digs through the ceiling. While it usually performs this attack twice, occasionally it will only perform one rush against either surface. Its head and body can be bounced off of while bulldozing across the ground."
                },
                {
                  "name": "Spit (Modified)",
                  "description": "The head spits more projectiles."
                },
                {
                  "name": "Bombardment (Modified)",
                  "description": "The rear end fires a third bomb."
                }
              ],
              "notes": "All of Bell Eater's attacks deal 2 Masks of Damage, including contact damage; with its swiping leg attacks dealing 2 in quick succession."
            }
          ],
          "strategy": "Red tools with mobility or AOE damage are ideal, such as the Cogfly and the Voltvessels. Blue tools such as Reserve Bind, Fractured Mask, and Injector Band are good options for this encounter. If using a tool focused build, Pollip Pouch and Quick Sling are good options. The only yellow tool that is useful for this fight is the Magnetite Dice, for a small chance to negate damage. For the Bell Bulldoze attack, if it occurs along the ground, Hornet must stay in the air to avoid taking damage. This can be done using Drifter's Cloak, Bind, or pogoing. Using Bind is dangerous because of the falling bells."
        }
      }
    },
    {
      "id": 3,
      "name": "Broodmother",
      "location": "The Slab",
      "health": 700,
      "phases": 2,
      "image": "../images/Bosses/broodmother.png",
      "information": {
        "behavior and tactics": {
          "summary": "Upon entering the arena, Hornet is locked in and must first fight through the following waves of enemies: Wave 1: 4 Freshflies. Wave 2: 3 Freshflies and a Guardfly. Wave 3: 3 Freshflies and a Wardenfly. Afterwards Broodmother flies into the centre of the arena and wails, beginning the boss fight.",
          "phases": [
            {
              "name": "Phase 1",
              "description": "Broodmother hovers around the top half of the arena and uses the following attacks:",
              "attacks": [
                {
                  "name": "Broodspawn",
                  "description": "Broodmother spawns 1-2 Freshflies in a row diagonally below her. The explosion from these flies does not damage her."
                },
                {
                  "name": "Muck Spit",
                  "description": "Broodmother spits 1-2 globs of muck in succession diagonally downwards towards Hornet which stick to the ground. The globs can be attacked to destroy them. The muck deals no damage, but if Hornet gets caught, she will be immobilized and needs to remove the muck by pressing ATTACK 4 times."
                },
                {
                  "name": "Grabbing Leap",
                  "description": "Broodmother rears back before launching herself at Hornet across roughly half the arena and landing on the ground. If Hornet is close to the ground after this she lands, Broodmother can turn around and leap towards her again. This can be repeated up to 2 times."
                },
                {
                  "name": "Buzz Away",
                  "description": "Broodmother will fly backwards a short distance away from Hornet if she is too close after an attack."
                }
              ]
            },
            {
              "name": "Phase 2",
              "trigger": "After reaching 385 HP, Broodmother roars and immediately performs the Wild Slam attack, she then adds this attack to her arsenal:",
              "attacks": [
                {
                  "name": "Wild Slam",
                  "description": "Broodmother wails and then slams her body between the floor and ceiling 5 times; slowly moving a short distance forwards with every slam and turning without stopping when reaching a wall. She will always slam downwards first and thus also end the attack with a ground slam."
                }
              ],
              "notes": "Broodmother deals 2 Masks of damage on contact."
            }
          ]
        }
      }
    },
    {
      "id": 4,
      "name": "Cogwork Dancers",
      "location": "Cogwork Core",
      "health": 630,
      "phases": 4,
      "image": "../images/Bosses/cogworkdancers.png",
      "information": {
        "behavior and tactics": {
          "summary": "This battle is split into 4 phases, each marked by the Dancers moving back to their stations to be wound up. Cogwork Dancers do not share HP; a phase ends when either reaches 0 health for that phase. All of their attacks have clear telegraphs and are performed on a rhythm.",
          "phases": [
            {
              "name": "Phase 1",
              "attacks": [
                {
                  "name": "Cogwork Cadence",
                  "description": "Each Dancer simultaneously projects a light beam from its head before dashing in that direction. If one dashes to the ground with this attack, it slashes to both sides as it lands. One of the Dancers may remain in place and simply spin around."
                },
                {
                  "name": "Cogwork Configuration",
                  "description": "Both Dancers leave the arena temporarily, then a pattern of light beams appears. The Dancers attack by dashing along each light beam, then return to the arena."
                },
                {
                  "name": "Cogwork Clash",
                  "description": "Both Dancers project light beams towards the centre where a circle telegraph appears. They dash toward the centre, then attack in a flurry of slashes within the circle."
                }
              ],
              "notes": "All attacks deal 2 Masks of damage; contact deals 2 Masks at once, while Cogwork Clash or Cogwork Configuration deal 1 Mask twice."
            },
            {
              "name": "Phase 2",
              "description": "Their attacks become faster and they sometimes use Cogwork Configuration twice in a row."
            },
            {
              "name": "Phase 3",
              "description": "Each Dancer performs Cogwork Cadence offset from one another."
            },
            {
              "name": "Phase 4",
              "description": "This phase begins when one Dancer is destroyed, continuing the fight with only one Dancer at a much slower pace. If it attempts to use Cogwork Clash, it fails and drops to the ground. It can no longer use Cogwork Configuration."
            }
          ]
        }
      }
    },
    {
      "id": 5,
      "name": "Crawfather",
      "location": "Craw Lake",
      "health": 1300,
      "phases": 1,
      "image": "../images/Bosses/crawfather.png",
      "information": {
        "behavior and tactics": {
          "summary": "Crawfather starts his trial by summoning several waves of enemies in his arena: 1x Squatcraw Juror and 1x Tallcraw Juror, then 2x Craw Jurors, then 2x Squatcraw Jurors, then 2x Craw Jurors, and finally 2x Tallcraw Jurors. Once all waves have been defeated, he flies in himself to deliver punishment to Hornet.",
          "phases": [
            {
              "name": "Phase 1",
              "attacks": [
                {
                  "name": "Triple Peck",
                  "description": "Crawfather reels his head back, before pecking the ground three times, moving forward with each attack. This attack deals two masks of damage."
                },
                {
                  "name": "Summon Juror",
                  "description": "Crawfather screams, summoning either two Craw Jurors, one Tallcraw Juror, or one Squatcraw Juror."
                },
                {
                  "name": "Dive Peck",
                  "description": "Crawfather takes flight, flutters for a short while, then dashes towards Hornet with his beak, dealing two masks of damage."
                }
              ]
            },
            {
              "name": "Mid-Fight",
              "trigger": "After enough damage is dealt, Crawfather obtains another attack:",
              "attacks": [
                {
                  "name": "Chain Punishment",
                  "description": "Crawfather flutters at a medium height, sending chains in all directions. After a short while, the chains erupt in barbed spikes, dealing two damage on hit. After this, Crawfather falls back to the ground, striking with his beak down below."
                }
              ]
            }
          ],
          "strategy": "The Jurors are beefier versions of the Crawbugs from earlier in Greymoor. Tactics from before are just as effective in dispatching them, though bear in mind that the spiked crowns on the Tallcraw and Squatcraw Jurors make aerial down-attacks less effective. Prioritize defeating any Jurors that join the fight. The Crawfather himself is less complex than handling multiple enemies. Despite being a winged boss, the Crawfather spends a lot of time on the ground, and is highly vulnerable to ground-based Tools such as Tacks and Cogwork Wheel."
        }
      }
    },
    {
      "id": 6,
      "name": "Crust King Khann",
      "location": "Coral Tower",
      "health": 1650,
      "phases": 2,
      "image": "../images/Bosses/crustkingkhann.png",
      "information": {
        "behavior and tactics": {
          "phases": [
            {
              "name": "Phase 1",
              "description": "During his first phase, Crust King Khann has 5 attacks:",
              "attacks": [
                {
                  "name": "Coral Strike",
                  "description": "Crust King Khann summons a horizontal coral pillar across the width of the arena."
                },
                {
                  "name": "Coral Pillar",
                  "description": "Crust King Khann summons a vertical coral pillar at Hornet's position."
                },
                {
                  "name": "Aerial Coral Strike",
                  "description": "Crust King Khann leaps into the air and summons a coral pillar diagonally downwards towards Hornet."
                },
                {
                  "name": "Coral Cross",
                  "description": "Crust King Khann summons 2 diagonal coral pillars from the ground, forming an x-shape above him."
                },
                {
                  "name": "Coral Overgrowth",
                  "description": "Crust King Khann shouts and causes 3 coral growths to erupt randomly across the floor and ceiling each."
                }
              ]
            },
            {
              "name": "Phase 2",
              "trigger": "After losing enough health, Crust King Khann shouts, marking the beginning of the second phase.",
              "description": "During this phase, one of his previous attacks gains new properties, and he begins using a new attack:",
              "attacks": [
                {
                  "name": "Coral Cross (Modified)",
                  "description": "Crust King Khann may execute another attack at a quicker pace or summon a second set of diagonal coral pillars from the ceiling, their bases closer together than the first."
                },
                {
                  "name": "Spike Rain",
                  "description": "Crust King Khann slams the ground, summoning 6 evenly spaced coral spikes that fall from the ceiling. Crust King Khann will always use this attack at the start of the second phase."
                }
              ]
            }
          ],
          "strategy": "The difficulty with Khann lies more in the Coral Tower combat gauntlets leading up to him than the fight himself. Prioritize flying enemies as grounded ones are easier to deal with alone. Clawline can catch them in the air and set up Hornet for a follow-up strike. Knockback from Hornet's melee attacks can push non-flying enemies into the spikes to speed up the progress of the gauntlet. The best times to strike Khann is when he's using Coral Pillar or shortly after Aerial Coral Strike, as there will be safe zones near him that the attacks will not cover. While he is in the air preparing for Aerial Coral Strike, stand directly under him, as launching the attack has a backwards recoil on him and he will land directly in front of Hornet. Going too far forward risks collision damage."
        }
      }
    },
    {
      "id": 7,
      "name": "Disgraced Chef Lugoli",
      "location": "Sinner's Road",
      "health": 600,
      "phases": 2,
      "image": "../images/Bosses/disgracedcheflugoli.png",
      "information": {
        "behavior and tactics": {
          "summary": "After entering the arena, Hornet must ring the massive gong hanging from the ceiling to initiate the fight. The gong first summons 2 Roachservers from the background, which must be killed before the boss fight begins.",
          "phases": [
            {
              "name": "Phase 1",
              "description": "Lugoli descends from the ceiling, directly into a Slam attack in the middle of the arena. They then float about the room and have the following attacks:",
              "attacks": [
                {
                  "name": "Slam",
                  "description": "Lugoli flies a short distance diagonally upwards to position over Hornet. They then slam themselves into the ground, sending 4 arcing Muckmaggot Globs flying, 2 in each direction."
                },
                {
                  "name": "Leaping Butt Slam",
                  "description": "Lugoli leaps, rear first, horizontally towards Hornet, and landing on the ground after. The leap covers over half of the arena."
                },
                {
                  "name": "Ladle Slap",
                  "description": "Lugoli winds up their ladle for a moment, before quickly slamming it into the ground in Hornet's direction, flinging 2 arcing Muckmaggot Globs forward."
                }
              ]
            },
            {
              "name": "Phase 2",
              "trigger": "After reaching 300 HP, Lugoli will roar and immediately perform the Muckmaggot Dive attack. They then add this attack to their arsenal.",
              "attacks": [
                {
                  "name": "Muckmaggot Dive",
                  "description": "Lugoli grunts then makes a large dive into the muck under the floor; randomly choosing either the left, right, or centre of the arena. When they hit the water it flings out 5 Muckmaggot Globs - 2 arcing in each direction and 1 directly upwards. They then emerge again from the same spot, flinging 5 more Muckmaggot Lumps."
                }
              ],
              "notes": "Lugoli deals 2 Masks of contact damage. Muckmaggot Lumps will deal 1 Mask of damage and infest Hornet if they hit her. Lumps ricochet off walls and are destroyed when they hit the ground. Striking them with the Needle stops their momentum. Equipping the Wreath of Purity prevents the infestation up to 3 times, but does not block the damage."
            }
          ]
        }
      }
    },
    {
      "id": 8,
      "name": "Father of the Flame",
      "location": "Wisp Thicket",
      "health": 640,
      "phases": 2,
      "image": "../images/Bosses/fatheroftheflame.png",
      "information": {
        "behavior and tactics": {
          "summary": "Father of the Flame is a unique fight as it has to be struck in particular parts of its body, depending on the phase, to deal damage to it. Hitting Father of the Flame also does not grant Hornet any Silk.",
          "phases": [
            {
              "name": "Phase 1",
              "description": "Father of the Flame spawns with four arms (two lower, two higher) and four balloons attached to parts of its body which allow Hornet to reach the higher arms. After destroying the higher arm in each side, the balloons attached to each also disappear. Each arm contains a glowing Wisp Lantern which must be destroyed to defeat the boss.",
              "attacks": [
                {
                  "name": "Wisp Summoning",
                  "description": "Wisps are summoned continuously by each of the Wisp Lanterns. With each destroyed arm, the Wisps are summoned faster."
                }
              ]
            },
            {
              "name": "Phase 2",
              "trigger": "After the Father of the Flame's arms have been destroyed, its body begins to burn fiercely and reveal a massive Wisp Lantern; which must now be attacked to damage it.",
              "attacks": [
                {
                  "name": "Ring of Fire",
                  "description": "The exposed main body unleashes a torrent of fireballs in all directions. It fires 4-5 waves of fireballs; some of them travelling in curved trajectories. Afterwards, it performs Wisp Summoning 3 times before repeating this attack."
                },
                {
                  "name": "Final Immolation",
                  "description": "Upon defeat, the massive Wisp Lantern falls and cracks against the ground, before creating a massive explosion."
                }
              ],
              "notes": "All the Father of the Flames' attacks deal 2 Masks of fire damage, which can be reduced to 1 with Magma Bell equipped."
            }
          ],
          "strategy": "Avoid using the Witch / Cursed Crest. Its down-slash is divided into 2 hits with the second only occurring when hitting enemies, which Father of the Flame's cages do not count as, resulting in it dealing about half as much damage as other crests in this fight. Cogflies cannot contribute to the fight as they cannot target the boss's weak points. Magma Bell is highly recommended in this fight as all damage sources in this fight inflict fire damage. The Wisps and fireballs are very easy to dodge, offering ample opportunity for the Bell to recharge and continue protecting Hornet. As melee attacks on this boss do not generate any Silk, Reserve Bind or Druid's Eye(s) can work as a way to get an additional heal opportunity. Reaper Crest and Wanderer Crest have downward slashes that make for easier pogo'ing on the stage obstacles and the boss's weak points. Reaper Crest has a larger melee range that gives better leeway, while Wanderer Crest has a faster attack speed to damage the boss quickly. For the two lower arms and the body, it's easy to stay on the ground, charge Needle Strike and strike while avoiding Wisps. Leave them for last in order to make getting to the higher arms easier. For the two higher arms, once the first Wisp is avoided, the sequence of Strike - Faydown Cloak - Strike can be used effectively to match the spawn rate of Wisp. The Delver's Drill can be a decent option for dealing high damage to the stationary cages without requiring the precise timing and positioning of repeated pogos, but leaves Hornet vulnerable to attack while being used. Alternatively, the Clawline - jump - Clawline sequence to attack the two upper arms is recommended for players who want to advance the fight faster. Thread Storm is large enough to hit both of the cages on the right arms. This may require presice placement to destroy both, however. Voltvessels can be used to deal large amounts of damage in a column, damaging the cages while remaining on the ground."
        }
      }
    },
    {
      "id": 9,
      "name": "First Sinner",
      "location": "The Slab",
      "health": 1300,
      "phases": 2,
      "image": "../images/Bosses/firstsinner.png",
      "information": {
        "behavior and tactics": {
          "phases": [
            {
              "name": "Phase 1",
              "description": "During her first phase, First Sinner has the following attacks:",
              "attacks": [
                {
                  "name": "Needle Weaving",
                  "description": "First Sinner channels for a brief moment which pulls up Needles from the background and positions them in the air, before launching them in various patterns (cross shape, vertical, diagonal, horizontal). She can occasionally layer two patterns together after her health drops below 1105 HP."
                },
                {
                  "name": "Bind",
                  "description": "First Sinner channels Silk for about 2 seconds, before healing herself for 130 HP. This ability can be interrupted by damaging her while she's channelling. She gains this attack after reaching 1105 HP."
                },
                {
                  "name": "Frenzied Charge",
                  "description": "First Sinner charges across the length of the arena towards Hornet while swinging her blades."
                },
                {
                  "name": "Aerial Lunge",
                  "description": "First Sinner teleports or leaps into the air near Hornet and performs 2 quick slashes diagonally downwards in Hornet's direction."
                },
                {
                  "name": "Teleport",
                  "description": "First Sinner teleports to a random location in the arena between attacks."
                },
                {
                  "name": "Skitter",
                  "description": "First Sinner skitters away from Hornet if she is too close, or towards her if she is too far away to reposition."
                }
              ]
            },
            {
              "name": "Phase 2",
              "trigger": "After reaching 650 HP, First Sinner teleports out of view for a few moments before reappearing and shouting, marking the start of the second phase.",
              "description": "During this phase, First Sinner performs her attacks at a much faster pace, and she gains an attack:",
              "attacks": [
                {
                  "name": "Rune Rage",
                  "description": "First Sinner rises into the air and weaves 12 circles of blazing Silk randomly throughout the arena. After a short moment, these circles explode into runes in rapid succession in the order in which they appeared."
                }
              ],
              "notes": "All of First Sinner's attacks deal 2 Masks of damage, with her Frenzied Charge dealing 2 Masks in quick succession if Hornet is caught in a swing."
            }
          ]
        }
      }
    },
    {
      "id": 10,
      "name": "Forebrothers Signis and Gron",
      "location": "Deep Docks",
      "health": 1240,
      "phases": 3,
      "image": "../images/Bosses/forebrotherssignisandgron.png",
      "information": {
        "behavior and tactics": {
          "phases": [
            {
              "name": "Phase 1 (Forebrother Signis)",
              "description": "When the fight is initiated, Forebrother Signis shouts, causing 2 grates to open up and constant streams of lava to flow on the left and right sides of the room; trapping Hornet in an arena. Signis himself performs the following attacks:",
              "attacks": [
                {
                  "name": "Reposition",
                  "description": "Signis can run or make small leaps around the arena to reposition for attacks."
                },
                {
                  "name": "Protect",
                  "description": "Signis skips backwards across the arena while spinning his staff."
                },
                {
                  "name": "Spinning Combo",
                  "description": "Signis slashes twice in a row, travelling forwards with each, and finishes off the second slash by spinning his staff in front of himself."
                },
                {
                  "name": "Flaming Boomerang",
                  "description": "Signis spins his staff, then throws it horizontally at Hornet. After travelling a distance of roughly 3 quarters of the arena, the staff flies back to him. He sometimes makes a short backwards dash either before performing this attack, or while the staff is still spinning - causing it to travel a longer distance back to him."
                },
                {
                  "name": "Summon",
                  "description": "Signis shouts, summoning enemies that drop from the ceiling. This attack is used only 3 times at certain HP thresholds (648 HP: Flintstone Flyer; 504 HP: Smokerock Sifter and Flintstone Flyer). If fought in Act 3 the summoned enemies have a chance to become Void-corrupted."
                }
              ]
            },
            {
              "name": "Phase 2 (Forebrothers Signis & Gron)",
              "trigger": "At 360 HP, Signis summons Forebrother Gron who falls into the arena with a Dive attack and begins the second phase.",
              "description": "In this phase, Forebrother Signis' behaviour stays the same, while Forebrother Gron has the following attacks:",
              "attacks": [
                {
                  "name": "Spear Throw (Gron)",
                  "description": "Gron makes a large leap upwards, and throws his spear at Hornet at the height of the jump, which propels him backwards slightly as he falls back down. If the spear embeds into the ground, the tip explodes shortly after."
                },
                {
                  "name": "Explosive Dive (Gron)",
                  "description": "Gron leaps upwards directly above Hornet's position, then dives down to the floor using his spear, causing an explosion where he lands."
                }
              ]
            },
            {
              "name": "Phase 3",
              "trigger": "After either Forebrother is defeated, if the remaining one is below 350 HP he gains 200 HP up to 350 max, and continues to fight.",
              "description": "A flow of lava will begin to periodically fall in the centre of the arena. Depending on which Forebrother remains, their behaviour is altered. They will try to stay on the opposite side of the lava stream from Hornet, using ranged attacks (Flaming Boomerang for Signis, Spear Throw for Gron). They will only use melee attacks if Hornet gets too close."
            }
          ],
          "strategy": "Forebrothers Signis & Gron are immune to attacks from above. Hornet can still Needle-bounce off their bell helmets, but this will deal no damage. Both bosses' spear attacks deal 2 Masks of fire damage that can be reduced to 1 by equipping the Magma Bell."
        }
      }
    },
    {
      "id": 11,
      "name": "Fourth Chorus",
      "location": "Far Fields",
      "health": 500,
      "phases": 4,
      "image": "../images/Bosses/fourthchorus.png"
    },
    {
      "id": 12,
      "name": "Garmond and Zaza",
      "location": "Greymoor, Sinner's Road, Choral Chambers, Whispering Vaults, High Halls",
      "health": 460,
      "phases": 1,
      "image": "../images/Bosses/garmondandzaza.png"
    },
    {
      "id": 13,
      "name": "Grandmother Silk",
      "location": "The Cradle",
      "health": 1095,
      "phases": 6,
      "image": "../images/Bosses/grandmothersilk.png"
    },
    {
      "id": 14,
      "name": "Great Conchflies",
      "location": "Blasted Steps",
      "health": 400,
      "phases": 1,
      "image": "../images/Bosses/greatconchflies.png"
    },
    {
      "id": 15,
      "name": "Groal the Great",
      "location": "Bilewater",
      "health": 650,
      "phases": 2,
      "image": "../images/Bosses/groalthegreat.png"
    },
    {
      "id": 16,
      "name": "Gurr the Outcast",
      "location": "Far Fields",
      "health": 1000,
      "phases": 1,
      "image": "../images/Bosses/gurrtheoutcast.png"
    },
    {
      "id": 17,
      "name": "Lace",
      "location": "Deep Docks",
      "health": 250,
      "phases": 1,
      "image": "../images/Bosses/lace.png"
    },
    {
      "id": 18,
      "name": "Lace",
      "location": "The Cradle",
      "health": 800,
      "phases": 3,
      "image": "../images/Bosses/lace.png"
    },
    {
      "id": 19,
      "name": "Last Judge",
      "location": "Blasted Steps",
      "health": 720,
      "phases": 2,
      "image": "../images/Bosses/lastjudge.png"
    },
    {
      "id": 20,
      "name": "Moorwing",
      "location": "Greymoor",
      "phases": 2,
      "health": 600,
      "image": "../images/Bosses/moorwing.png"
    },
    {
      "id": 21,
      "name": "Moss Mother",
      "location": "Ruined Chapel",
      "phases": 1,
      "health": 120,
      "image": "../images/Bosses/mossmother.png"
    },
    {
      "id": 22,
      "name": "Nyleth",
      "location": "Shellwood",
      "phases": 1,
      "health": 1250,
      "image": "../images/Bosses/nyleth.png"
    },
    {
      "id": 23,
      "name": "Palestag",
      "location": "Lost Verdania",
      "phases": 1,
      "health": 480,
      "image": "../images/Bosses/palestag.png"
    },
    {
      "id": 24,
      "name": "Phantom",
      "location": "Exhaust Organ",
      "phases": 2,
      "health": 650,
      "image": "../images/Bosses/phantom.png"
    },
    {
      "id": 25,
      "name": "Pinstress",
      "location": "Blasted Steps, Mount Fey",
      "phases": 1,
      "health": 910,
      "image": "../images/Bosses/pinstress.png"
    },
    {
      "id": 26,
      "name": "Plasmified Zango",
      "location": "Wormways",
      "phases": 1,
      "health": 1000,
      "image": "../images/Bosses/plasmifiedzango.png"
    },
    {
      "id": 27,
      "name": "Savage Beastfly",
      "location": "Chapel of the Beast",
      "phases": 2,
      "health": 550,
      "image": "../images/Bosses/savagebeastfly.png"
    },
    {
      "id": 28,
      "name": "Savage Beastfly",
      "location": "Far Fields",
      "phases": 2,
      "health": 650,
      "image": "../images/Bosses/savagebeastfly.png"
    },
    {
      "id": 29,
      "name": "Second Sentinel",
      "location": "Cogwork Core, Choral Chambers, High Halls",
      "phases": 1,
      "health": 800,
      "image": "../images/Bosses/secondsentinel.png"
    },
    {
      "id": 30,
      "name": "Shakra",
      "location": "Greymoor",
      "phases": 1,
      "health": 600,
      "image": "../images/Bosses/shakra.png"
    },
    {
      "id": 31,
      "name": "Shrine Guardian Seth",
      "location": "Shellwood, Greymoor, Fleatopia",
      "phases": 1,
      "health": 1185,
      "image": "../images/Bosses/shrineguardianseth.png"
    },
    {
      "id": 32,
      "name": "Sister Splinter",
      "location": "Shellwood",
      "phases": 2,
      "health": 310,
      "image": "../images/Bosses/sistersplinter.png"
    },
    {
      "id": 33,
      "name": "Skarrsinger Karmelita",
      "location": "Far Fields",
      "phases": 3,
      "health": 1500,
      "image": "../images/Bosses/skarrsingerkarmelita.png"
    },
    {
      "id": 34,
      "name": "Skull Tyrant",
      "location": "The Marrow",
      "phases": 1,
      "health": 450,
      "image": "../images/Bosses/skulltyrant.png"
    },
    {
      "id": 35,
      "name": "Summoned Saviour",
      "location": "Bonegrave",
      "phases": 1,
      "health": 500,
      "image": "../images/Bosses/summonedsaviour.png"
    },
    {
      "id": 36,
      "name": "The Unravelled",
      "location": "Whiteward",
      "phases": 3,
      "health": 1000,
      "image": "../images/Bosses/theunravelled.png"
    },
    {
      "id": 37,
      "name": "Trobbio",
      "location": "The Stage",
      "phases": 2,
      "health": 700,
      "image": "../images/Bosses/trobbio.png"
    },
    {
      "id": 38,
      "name": "Voltvyrm",
      "location": "Voltnest",
      "phases": 1,
      "health": 550,
      "image": "../images/Bosses/voltvyrm.png"
    },
    {
      "id": 39,
      "name": "Watcher at the Edge",
      "location": "Sands of Karak",
      "phases": 1,
      "health": 900,
      "image": "../images/Bosses/watcherattheedge.png"
    },
    {
      "id": 40,
      "name": "Widow",
      "location": "Bellhart",
      "phases": 3,
      "health": 360,
      "image": "../images/Bosses/widow.png"
    }
  ]
}
